Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static void ReportLinkLoadResults(
	Document doc,
	IDictionary<string, LinkLoadResult> loadResults
)
  Visual Basic
Public Shared Sub ReportLinkLoadResults ( _
	doc As Document, _
	loadResults As IDictionary(Of String, LinkLoadResult) _
)
  Visual C++
public:
static void ReportLinkLoadResults(
	Document^ doc,
	IDictionary<String^, LinkLoadResult^>^ loadResults
)
 Parameters
  doc
 Type:  Autodesk.Revit.DB Document
  loadResults
 Type:  System.Collections.Generic IDictionary   String  ,  LinkLoadResult
 See Also
  RevitLinkUIUtils Class
  Autodesk.Revit.UI Namespace